In [26]:
import numpy as np

Arr = np.array([1,2,3,4,5,6])
print(Arr.ndim)

1

In [27]:
Arr1= np.array([[1,2,3,4,5,6],[11,22,33,44,55,66]])

print(Arr1.ndim)

2

In [28]:
Arr2 = np.array([[12,13],[1,2],[99,90]])
print(Arr2.ndim)

2

In [29]:
arr3 = np.array([])
print(arr3.ndim)

1

In [30]:
arrr4 = np.array([1,2,0.9,0.10])
print(arrr4.dtype)

float64

In [34]:
#converting a list to series
import pandas as pd
#list=["Name","Place","Occupation"]
series = pd.Series( ["abc","def","xyz"], index = ["Name","Place","Occupation"])

series

Name          abc
Place         def
Occupation    xyz
dtype: object

In [30]:
import numpy as np
data = np.array([1,2,3,4,np.nan,np.nan])
np.isnan(data)

array([False, False, False, False,  True,  True])

In [40]:
data[~np.isnan(data)]

array([2.5])

In [ ]:
np.nanmean(data)

np.float64(2.5)

In [45]:
arr = np.array([1,2,3,4,5,np.nan])
np.nansum(arr)

np.float64(15.0)

In [46]:
import pandas as pd

data = {
    'open_price':[100,200,3000,4000,500,600,700,800],
    'price': [150,250,350,450,550,650,750,850,],
    'closing_price':[150,200,250,300,350,400,450,500]
}

df = pd.DataFrame(data)
df

   open_price  price  closing_price
0         100    150            150
1         200    250            200
2        3000    350            250
3        4000    450            300
4         500    550            350
5         600    650            400
6         700    750            450
7         800    850            500

In [50]:
df.isnull()

   open_price  price  closing_price
0       False  False          False
1       False  False          False
2       False  False          False
3       False  False          False
4       False  False          False
5       False  False          False
6       False  False          False
7       False  False          False

In [52]:
data1={
    "name":["Krishn","Sujeet","kayum"],
    "age":[20,19,np.nan]
}
df=pd.DataFrame(data1)
a=df.isnull()
print(a)

    name    age
0  False  False
1  False  False
2  False   True